SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM21/Include/mgm21_frc.h
/* Bit fields for FRC MIRRORIF */
#define _FRC_MIRRORIF_RESETVALUE                           0x00000000UL                                        /**< Default value for FRC_MIRRORIF              */
#define _FRC_MIRRORIF_MASK                                 0x0003FFFFUL                                        /**< Mask for FRC_MIRRORIF                       */
#define FRC_MIRRORIF_TXDONE                                (0x1UL << 0)                                        /**< TX Done Interrupt Flag                      */
#define _FRC_MIRRORIF_TXDONE_SHIFT                         0                                                   /**< Shift value for FRC_TXDONE                  */
#define _FRC_MIRRORIF_TXDONE_MASK                          0x1UL                                               /**< Bit mask for FRC_TXDONE                     */
#define _FRC_MIRRORIF_TXDONE_DEFAULT                       0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_TXDONE_DEFAULT                        (_FRC_MIRRORIF_TXDONE_DEFAULT << 0)                 /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_TXAFTERFRAMEDONE                      (0x1UL << 1)                                        /**< TX after frame Done Interrupt Flag          */
#define _FRC_MIRRORIF_TXAFTERFRAMEDONE_SHIFT               1                                                   /**< Shift value for FRC_TXAFTERFRAMEDONE        */
#define _FRC_MIRRORIF_TXAFTERFRAMEDONE_MASK                0x2UL                                               /**< Bit mask for FRC_TXAFTERFRAMEDONE           */
#define _FRC_MIRRORIF_TXAFTERFRAMEDONE_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_TXAFTERFRAMEDONE_DEFAULT              (_FRC_MIRRORIF_TXAFTERFRAMEDONE_DEFAULT << 1)       /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_TXABORTED                             (0x1UL << 2)                                        /**< Transmit Aborted Interrupt Flag             */
#define _FRC_MIRRORIF_TXABORTED_SHIFT                      2                                                   /**< Shift value for FRC_TXABORTED               */
#define _FRC_MIRRORIF_TXABORTED_MASK                       0x4UL                                               /**< Bit mask for FRC_TXABORTED                  */
#define _FRC_MIRRORIF_TXABORTED_DEFAULT                    0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_TXABORTED_DEFAULT                     (_FRC_MIRRORIF_TXABORTED_DEFAULT << 2)              /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_TXUF                                  (0x1UL << 3)                                        /**< Transmit Underflow Interrupt Flag           */
#define _FRC_MIRRORIF_TXUF_SHIFT                           3                                                   /**< Shift value for FRC_TXUF                    */
#define _FRC_MIRRORIF_TXUF_MASK                            0x8UL                                               /**< Bit mask for FRC_TXUF                       */
#define _FRC_MIRRORIF_TXUF_DEFAULT                         0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_TXUF_DEFAULT                          (_FRC_MIRRORIF_TXUF_DEFAULT << 3)                   /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_RXDONE                                (0x1UL << 4)                                        /**< RX Done Interrupt Flag                      */
#define _FRC_MIRRORIF_RXDONE_SHIFT                         4                                                   /**< Shift value for FRC_RXDONE                  */
#define _FRC_MIRRORIF_RXDONE_MASK                          0x10UL                                              /**< Bit mask for FRC_RXDONE                     */
#define _FRC_MIRRORIF_RXDONE_DEFAULT                       0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_RXDONE_DEFAULT                        (_FRC_MIRRORIF_RXDONE_DEFAULT << 4)                 /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_RXABORTED                             (0x1UL << 5)                                        /**< RX Aborted Interrupt Flag                   */
#define _FRC_MIRRORIF_RXABORTED_SHIFT                      5                                                   /**< Shift value for FRC_RXABORTED               */
#define _FRC_MIRRORIF_RXABORTED_MASK                       0x20UL                                              /**< Bit mask for FRC_RXABORTED                  */
#define _FRC_MIRRORIF_RXABORTED_DEFAULT                    0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_RXABORTED_DEFAULT                     (_FRC_MIRRORIF_RXABORTED_DEFAULT << 5)              /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_FRAMEERROR                            (0x1UL << 6)                                        /**< Frame Error Interrupt Flag                  */
#define _FRC_MIRRORIF_FRAMEERROR_SHIFT                     6                                                   /**< Shift value for FRC_FRAMEERROR              */
#define _FRC_MIRRORIF_FRAMEERROR_MASK                      0x40UL                                              /**< Bit mask for FRC_FRAMEERROR                 */
#define _FRC_MIRRORIF_FRAMEERROR_DEFAULT                   0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_FRAMEERROR_DEFAULT                    (_FRC_MIRRORIF_FRAMEERROR_DEFAULT << 6)             /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_BLOCKERROR                            (0x1UL << 7)                                        /**< Block Error Interrupt Flag                  */
#define _FRC_MIRRORIF_BLOCKERROR_SHIFT                     7                                                   /**< Shift value for FRC_BLOCKERROR              */
#define _FRC_MIRRORIF_BLOCKERROR_MASK                      0x80UL                                              /**< Bit mask for FRC_BLOCKERROR                 */
#define _FRC_MIRRORIF_BLOCKERROR_DEFAULT                   0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_BLOCKERROR_DEFAULT                    (_FRC_MIRRORIF_BLOCKERROR_DEFAULT << 7)             /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_RXOF                                  (0x1UL << 8)                                        /**< Receive Overflow Interrupt Flag             */
#define _FRC_MIRRORIF_RXOF_SHIFT                           8                                                   /**< Shift value for FRC_RXOF                    */
#define _FRC_MIRRORIF_RXOF_MASK                            0x100UL                                             /**< Bit mask for FRC_RXOF                       */
#define _FRC_MIRRORIF_RXOF_DEFAULT                         0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_RXOF_DEFAULT                          (_FRC_MIRRORIF_RXOF_DEFAULT << 8)                   /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_ADDRERROR                             (0x1UL << 9)                                        /**< Receive address error event                 */
#define _FRC_MIRRORIF_ADDRERROR_SHIFT                      9                                                   /**< Shift value for FRC_ADDRERROR               */
#define _FRC_MIRRORIF_ADDRERROR_MASK                       0x200UL                                             /**< Bit mask for FRC_ADDRERROR                  */
#define _FRC_MIRRORIF_ADDRERROR_DEFAULT                    0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_ADDRERROR_DEFAULT                     (_FRC_MIRRORIF_ADDRERROR_DEFAULT << 9)              /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_BUSERROR                              (0x1UL << 10)                                       /**< A bus error event occurred                  */
#define _FRC_MIRRORIF_BUSERROR_SHIFT                       10                                                  /**< Shift value for FRC_BUSERROR                */
#define _FRC_MIRRORIF_BUSERROR_MASK                        0x400UL                                             /**< Bit mask for FRC_BUSERROR                   */
#define _FRC_MIRRORIF_BUSERROR_DEFAULT                     0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_BUSERROR_DEFAULT                      (_FRC_MIRRORIF_BUSERROR_DEFAULT << 10)              /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_SNIFFOF                               (0x1UL << 11)                                       /**< Data sniffer overflow                       */
#define _FRC_MIRRORIF_SNIFFOF_SHIFT                        11                                                  /**< Shift value for FRC_SNIFFOF                 */
#define _FRC_MIRRORIF_SNIFFOF_MASK                         0x800UL                                             /**< Bit mask for FRC_SNIFFOF                    */
#define _FRC_MIRRORIF_SNIFFOF_DEFAULT                      0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_SNIFFOF_DEFAULT                       (_FRC_MIRRORIF_SNIFFOF_DEFAULT << 11)               /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_FRAMEDETPAUSED                        (0x1UL << 12)                                       /**< Frame detected pause event active           */
#define _FRC_MIRRORIF_FRAMEDETPAUSED_SHIFT                 12                                                  /**< Shift value for FRC_FRAMEDETPAUSED          */
#define _FRC_MIRRORIF_FRAMEDETPAUSED_MASK                  0x1000UL                                            /**< Bit mask for FRC_FRAMEDETPAUSED             */
#define _FRC_MIRRORIF_FRAMEDETPAUSED_DEFAULT               0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_FRAMEDETPAUSED_DEFAULT                (_FRC_MIRRORIF_FRAMEDETPAUSED_DEFAULT << 12)        /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_INTERLEAVEWRITEPAUSED                 (0x1UL << 13)                                       /**< Interleaver write pause event active        */
#define _FRC_MIRRORIF_INTERLEAVEWRITEPAUSED_SHIFT          13                                                  /**< Shift value for FRC_INTERLEAVEWRITEPAUSED   */
#define _FRC_MIRRORIF_INTERLEAVEWRITEPAUSED_MASK           0x2000UL                                            /**< Bit mask for FRC_INTERLEAVEWRITEPAUSED      */
#define _FRC_MIRRORIF_INTERLEAVEWRITEPAUSED_DEFAULT        0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_INTERLEAVEWRITEPAUSED_DEFAULT         (_FRC_MIRRORIF_INTERLEAVEWRITEPAUSED_DEFAULT << 13) /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_INTERLEAVEREADPAUSED                  (0x1UL << 14)                                       /**< Interleaver read pause event active         */
#define _FRC_MIRRORIF_INTERLEAVEREADPAUSED_SHIFT           14                                                  /**< Shift value for FRC_INTERLEAVEREADPAUSED    */
#define _FRC_MIRRORIF_INTERLEAVEREADPAUSED_MASK            0x4000UL                                            /**< Bit mask for FRC_INTERLEAVEREADPAUSED       */
#define _FRC_MIRRORIF_INTERLEAVEREADPAUSED_DEFAULT         0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_INTERLEAVEREADPAUSED_DEFAULT          (_FRC_MIRRORIF_INTERLEAVEREADPAUSED_DEFAULT << 14)  /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_TXSUBFRAMEPAUSED                      (0x1UL << 15)                                       /**< Transmit subframe pause event active        */
#define _FRC_MIRRORIF_TXSUBFRAMEPAUSED_SHIFT               15                                                  /**< Shift value for FRC_TXSUBFRAMEPAUSED        */
#define _FRC_MIRRORIF_TXSUBFRAMEPAUSED_MASK                0x8000UL                                            /**< Bit mask for FRC_TXSUBFRAMEPAUSED           */
#define _FRC_MIRRORIF_TXSUBFRAMEPAUSED_DEFAULT             0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_TXSUBFRAMEPAUSED_DEFAULT              (_FRC_MIRRORIF_TXSUBFRAMEPAUSED_DEFAULT << 15)      /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_CONVPAUSED                            (0x1UL << 16)                                       /**< Convolutional coder pause event active      */
#define _FRC_MIRRORIF_CONVPAUSED_SHIFT                     16                                                  /**< Shift value for FRC_CONVPAUSED              */
#define _FRC_MIRRORIF_CONVPAUSED_MASK                      0x10000UL                                           /**< Bit mask for FRC_CONVPAUSED                 */
#define _FRC_MIRRORIF_CONVPAUSED_DEFAULT                   0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_CONVPAUSED_DEFAULT                    (_FRC_MIRRORIF_CONVPAUSED_DEFAULT << 16)            /**< Shifted mode DEFAULT for FRC_MIRRORIF       */
#define FRC_MIRRORIF_IFMIRRORCLEAR                         (0x1UL << 17)                                       /**< Clear bit for the FRC IF MIRROR Register    */
#define _FRC_MIRRORIF_IFMIRRORCLEAR_SHIFT                  17                                                  /**< Shift value for FRC_IFMIRRORCLEAR           */
#define _FRC_MIRRORIF_IFMIRRORCLEAR_MASK                   0x20000UL                                           /**< Bit mask for FRC_IFMIRRORCLEAR              */
#define _FRC_MIRRORIF_IFMIRRORCLEAR_DEFAULT                0x00000000UL                                        /**< Mode DEFAULT for FRC_MIRRORIF               */
#define FRC_MIRRORIF_IFMIRRORCLEAR_DEFAULT                 (_FRC_MIRRORIF_IFMIRRORCLEAR_DEFAULT << 17)         /**< Shifted mode DEFAULT for FRC_MIRRORIF       */

